#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudsbits/audiotube-org/runs/run-TFoEJFZi15Ko3Fep

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.aws_iam_policy_document.block_cloudtrial_configuration_policy: Refreshing...
aws_iam_openid_connect_provider.github_oidc: Refreshing state... [id=arn:aws:iam::928577306505:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.deny_leave_org_policy: Refreshing...
aws_organizations_organization.audiotube: Refreshing state... [id=o-nb5t6tuqud]
data.aws_iam_policy_document.block_cloudtrial_configuration_policy: Refresh complete after 0s [id=652164004]
data.aws_iam_policy_document.deny_leave_org_policy: Refresh complete after 0s [id=1881740481]
aws_organizations_policy.cloudtrail_config_policy: Refreshing state... [id=p-0y9tewpl]
aws_organizations_policy.deny_leave_org: Refreshing state... [id=p-hrvovuis]
data.aws_iam_policy_document.github_allow: Refreshing...
data.aws_iam_policy_document.github_allow: Refresh complete after 0s [id=2874903489]
aws_organizations_organizational_unit.workloads: Refreshing state... [id=ou-wpeg-czpfa1g5]
aws_organizations_policy_attachment.sandbox: Refreshing state... [id=r-wpeg:p-0y9tewpl]
aws_organizations_organizational_unit.security: Refreshing state... [id=ou-wpeg-6oqi13qq]
aws_organizations_policy_attachment.deny_leave_org_attachment: Refreshing state... [id=r-wpeg:p-hrvovuis]
aws_organizations_organizational_unit.infrastructure: Refreshing state... [id=ou-wpeg-t9b3a9yd]
aws_organizations_organizational_unit.infrastructure_preprod: Refreshing state... [id=ou-wpeg-8lyfjtup]
aws_organizations_organizational_unit.infrastructure_prod: Refreshing state... [id=ou-wpeg-jfv4hz65]
aws_organizations_organizational_unit.workloads_prod: Refreshing state... [id=ou-wpeg-h2gx0s8v]
aws_organizations_organizational_unit.workloads_preprod: Refreshing state... [id=ou-wpeg-xc6lidil]
aws_organizations_organizational_unit.prod: Refreshing state... [id=ou-wpeg-gt7e70bu]
aws_organizations_organizational_unit.sandbox: Refreshing state... [id=ou-wpeg-lge8a0cn]
aws_organizations_account.audiotube_infrastructure_prod: Refreshing state... [id=492591972950]
aws_organizations_account.audiotube_infrastructure_preprod: Refreshing state... [id=064787544343]
aws_organizations_account.audiotube_workloads_preprod: Refreshing state... [id=155602617137]
aws_organizations_account.audiotube_workloads_prod: Refreshing state... [id=022226443461]
aws_organizations_account.audiotube_security_prod: Refreshing state... [id=950781446058]
aws_organizations_account.audiotube_sandbox: Refreshing state... [id=257625454150]
aws_iam_openid_connect_provider.github_oidc: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.github_role will be created
  + resource "aws_iam_role" "github_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:Kostua/audiotube:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::928577306505:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "GithubActionsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 21 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Kostua, Action: `pull_request`*